# Anova Feature Selection Method by `Mr. Harshit Dawar!`
* It is used to Test the Hypothesis that 2 or more features are having the same mean.


* It is also a Univariate Feature Selection Method.


* It stands for Analysis of Variance.


* It can be used for Categorical as well as Numerical Features.


* It also calculates the p-value of the Features. The less the p - value is for a particular feature, the more the significance of that particular feature. But be cautiaus with this fact in very large dataset, because there the sample size may make the p-value of some feature to be very small, but in that case there might be a possibility that the feature is not that much strong to predict the Target.

In [2]:
# Importing the Libraries

import pandas as pd
import numpy as np
from sklearn.feature_selection import f_classif, f_regression, SelectKBest, SelectPercentile

# ANOVA for Classification!

In [3]:
# Loading the Dataset

data = pd.read_csv("../ds/Titanic_Dataset.csv")

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Processing the Dataset

data.drop(["PassengerId", "Name", "Cabin", "Ticket", "Fare"], axis = 1, inplace = True )

In [6]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S